In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
df=pd.read_csv(r"C:\Users\dai\Desktop\data_null.txt",delimiter=' ')
df

     ord_no  purch_amt    ord_date  customer_id  salesman_id
0   70001.0     150.50  2012-10-05         3002       5002.0
1       NaN     270.65  2012-09-10         3001       5003.0
2   70002.0      65.26         NaN         3001       5001.0
3   70004.0     110.50  2012-08-17         3003          NaN
4       NaN     948.50  2012-09-10         3002       5002.0
5   70005.0    2400.60  2012-07-27         3001       5001.0
6       NaN    5760.00  2012-09-10         3001       5001.0
7   70010.0    1983.43  2012-10-10         3004          NaN
8   70003.0    2480.40  2012-10-10         3003       5003.0
9   70012.0     250.45  2012-06-27         3002       5002.0
10      NaN      75.29  2012-08-17         3001       5003.0
11  70013.0    3045.60  2012-04-25         3001          NaN

## 1. Write a Pandas program to detect missing values of a given DataFrame.Display True or False.

In [4]:
df.isnull()

    ord_no  purch_amt  ord_date  customer_id  salesman_id
0    False      False     False        False        False
1     True      False     False        False        False
2    False      False      True        False        False
3    False      False     False        False         True
4     True      False     False        False        False
5    False      False     False        False        False
6     True      False     False        False        False
7    False      False     False        False         True
8    False      False     False        False        False
9    False      False     False        False        False
10    True      False     False        False        False
11   False      False     False        False         True

## 2. Write a Pandas program to identify the column(s) of a given DataFrame which have at least one missing value.

In [31]:
res=[]
for columns in df:
    cnt=0
    for x in df[columns]:
        if pd.isnull(x):
            cnt+=1
        if cnt>=1:
            res.append(columns)
            cnt=0
            break
res

['ord_no', 'ord_date', 'salesman_id']

In [33]:
res=[]
for col in df:
    if df[col].isna().any():
        res.append(col)
res

['ord_no', 'ord_date', 'salesman_id']

In [35]:
df.columns[df.isna().any()]

Index(['ord_no', 'ord_date', 'salesman_id'], dtype='object')

## 3. Write a Pandas program to count the number of missing values in each column of a given DataFrame.

In [36]:
df.isnull().sum()

ord_no         4
purch_amt      0
ord_date       1
customer_id    0
salesman_id    3
dtype: int64

## 4. Write a Pandas program to find and replace the missing values in a given DataFrame which do not have any valuable information.